# Review Python Language

In [5]:
my_name = "Park"
my_age = 23

In [6]:
print(my_name)
print(my_age)

Park
23

In [10]:
print(1+1)
print(2*2)
print(5/2)
print(8-5)

2
4
2.5
3

In [11]:
# string & fstring in Python
my_name = "Park"
my_university = "KMUTNB"

my_long_string = """this is a very long
    this is a second line
    this is a third line
"""

print(my_name,my_university,my_long_string)

Park KMUTNB this is a very long
    this is a second line
    this is a third line

In [13]:
# fstring template
my_name = "Park"
my_age = 23

text = f"my name is {my_name} , and I am {my_age} years old."
print(text)

my name is Park , and I am 23 years old.

In [14]:
# function designed for string (string methods)
text = "a duck walks into a bar"

In [16]:
"HELLO WORLD".lower()

'hello world'

In [17]:
text.count("d")

1

In [18]:
text2 = text.replace('duck','lion')
print(text)
print(text2)

a duck walks into a bar
a lion walks into a bar

In [3]:
# list
shopping_list = ['egg','milk','bread']
print(shopping_list)

['egg', 'milk', 'bread']

In [6]:
print(shopping_list[0:3])

['egg', 'milk', 'bread']

In [7]:
# list method = append
shopping_list.append('orange juice')
print(shopping_list)

['egg', 'milk', 'bread', 'orange juice']

In [8]:
shopping_list.append('water bottle')
print(shopping_list)

['egg', 'milk', 'bread', 'orange juice', 'water bottle']

In [9]:
# list method .pop()
shopping_list.pop()

'water bottle'

In [10]:
shopping_list

['egg', 'milk', 'bread', 'orange juice']

In [11]:
len(shopping_list)

4

In [13]:
# dictionary key-value pair
student = {
    "id" :1 ,
    "name" : "Park",
    "age" : 23,
    "movies" : ["Spider Man","Thor","Iron Man 3"]
}

In [20]:
student['movies'][1]

'Thor'

In [21]:
student['city'] = 'London'
student

{'id': 1,
 'name': 'Park',
 'age': 23,
 'movies': ['Spider Man', 'Thor', 'Iron Man 3'],
 'city': 'London'}

In [23]:
student['city'] = 'Manchester'
student

{'id': 1,
 'name': 'Park',
 'age': 23,
 'movies': ['Spider Man', 'Thor', 'Iron Man 3'],
 'city': 'Manchester'}

In [25]:
# remove key-value
del student['city']
student

{'id': 1,
 'name': 'Park',
 'age': 23,
 'movies': ['Spider Man', 'Thor', 'Iron Man 3']}

In [6]:
# user-defined function
def hello (username):
    print("Hello !"+ username)

In [8]:
hello("park")

Hello !park

In [9]:
def my_sum(val1,val2):
    return val1+val2

result = my_sum(5,15)

In [10]:
print(result)

20

# OOP
Object Oriented Programming

In [21]:
class Dog:
    name = "park"
    age = 5
    color = "Brown"
    breed = "French Bulldog"

    #function(Dog method)
    def sitting(self):
        print("I am sitting now!")
    
    def hungry(self,food_name):
        print(f"I am hungry , I need {food_name}!")

In [22]:
my_dog = Dog()
type(my_dog)

__main__.Dog

In [23]:
my_dog.sitting()

I am sitting now!

In [24]:
my_dog.hungry("Hotdog")

I am hungry , I need Hotdog!

# Basic Pandas

In [25]:
import pandas as pd

In [32]:
# create dataframe from scratch
raw_data = {
    "name" : ["Park","Tree","Mary","John","Anna"],
    "age" :[23,25,20,22,31],
    "gender" : ["M","M","F","M","F"]
}

df = pd.DataFrame(raw_data)
df

,name,age,gender
0,Park,23,M
1,Tree,25,M
2,Mary,20,F
3,John,22,M
4,Anna,31,F

In [33]:
# add new column
df['city'] = ['London','London','London','Manchester','liverpool']

In [34]:
df

,name,age,gender,city
0,Park,23,M,London
1,Tree,25,M,London
2,Mary,20,F,London
3,John,22,M,Manchester
4,Anna,31,F,liverpool

In [35]:
df.shape

(5, 4)

In [37]:
# drop column city
df = df.drop('city',axis=1)

In [38]:
df

,name,age,gender
0,Park,23,M
1,Tree,25,M
3,John,22,M
4,Anna,31,F

In [36]:
# remove index = 2
df = df.drop(2,axis=0)

In [39]:
df

,name,age,gender
0,Park,23,M
1,Tree,25,M
3,John,22,M
4,Anna,31,F

In [40]:
# reset index
df = df.reset_index(drop=True)
df

,name,age,gender
0,Park,23,M
1,Tree,25,M
2,John,22,M
3,Anna,31,F

In [43]:
# column names
list(df.columns)

['name', 'age', 'gender']

In [46]:
# rename columns
df.columns = ['nickname','age','sex']
df

,nickname,age,sex
0,Park,23,M
1,Tree,25,M
2,John,22,M
3,Anna,31,F

In [48]:
type(df['nickname'])

pandas.core.series.Series

In [49]:
type(df)

pandas.core.frame.DataFrame

In [55]:
# create a new series
s1 = pd.Series(['Mary',20,'F'],index=['nickname','age','sex'] )
print(s1)
print(type(s1))

nickname    Mary
age           20
sex            F
dtype: object
<class 'pandas.core.series.Series'>

In [72]:
# append s1 to df
df = df.append(s1,ignore_index=True)
df

,nickname,age,sex
0,Park,23,M
1,Tree,25,M
2,John,22,M
3,Anna,31,F
4,Mary,20,F

In [74]:
s2 = pd.Series(['London','London','London','Manchester','liverpool'])
df['city'] = s2
df

,nickname,age,sex,city
0,Park,23,M,London
1,Tree,25,M,London
2,John,22,M,London
3,Anna,31,F,Manchester
4,Mary,20,F,liverpool

In [76]:
# write scv file
df.to_csv('mydata.csv')

In [77]:
# import csv file
df2 = pd.read_csv('data/data.csv')
df2

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [1]:
# import excel file
import pandas as pd
df3 = pd.read_excel('data/data.xlsx')

In [2]:
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [4]:
# import json file
df4 = pd.read_json('data/data.json')
df4

,ebook,language,amazonRating,myFavorite
0,Getting started with Python,python,4.89,True
1,Introduction to R,r,4.88,False
2,SQL for Beginners,sql,4.75,True

In [5]:
df4['myFavorite'].dtype

dtype('bool')